-- 1.Напишете заявка, която извежда номер на модел, честота и размер на диска за
-- всички компютри с цена по-малка от 1200 долара. Задайте псевдоними за
-- атрибутите честота и размер на диска, съответно MHz и GB 
select model, speed as MHz, hd as GB 
from pc
where price < 1200;

-- 2.Напишете заявка, която извежда всички производители на принтери без повторения
select distinct maker 
from product
where type like 'printer';

-- 3.Напишете заявка, която извежда номер на модел, размер на паметта, размер на
-- екран за лаптопите, чиято цена е по-голяма от 1000 долара
select model, ram, screen 
from laptop
where price > 1000;

-- 4.Напишете заявка, която извежда всички цветни принтери
select * from printer
where color like 'y';

-- 5. Напишете заявка, която извежда номер на модел, честота и размер на диска за
-- тези компютри с DVD 12x или 16x и цена по-малка от 2000 долара. 
select model, speed, hd 
from pc
where (cd like '12%' or cd like '16%') and price < 2000;

